Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32WM_BZ6204_DFP/component/hmatrix2top.h
/*
 * Component description for HMATRIX2TOP
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-01-29T18:23:31Z  */
#ifndef _PIC32WM_BZ6_HMATRIX2TOP_COMPONENT_H_
#define _PIC32WM_BZ6_HMATRIX2TOP_COMPONENT_H_

/* ************************************************************************** */
/*                  SOFTWARE API DEFINITION FOR HMATRIX2TOP                   */
/* ************************************************************************** */

/* -------- HMATRIX2TOP_PRAS0 : (HMATRIX2TOP Offset: 0x80) (R/W 32) Priority part A for Target 0 -------- */
#define HMATRIX2TOP_PRAS0_RESETVALUE          _UINT32_(0x03)                                       /*  (HMATRIX2TOP_PRAS0) Priority part A for Target 0  Reset Value */

#define HMATRIX2TOP_PRAS0_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS0) Register Mask  */


/* -------- HMATRIX2TOP_PRBS0 : (HMATRIX2TOP Offset: 0x84) (R/W 32) Priority part B for Target 0 -------- */
#define HMATRIX2TOP_PRBS0_RESETVALUE          _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS0) Priority part B for Target 0  Reset Value */

#define HMATRIX2TOP_PRBS0_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS0) Register Mask  */


/* -------- HMATRIX2TOP_PRAS1 : (HMATRIX2TOP Offset: 0x88) (R/W 32) Priority part A for Target 1 -------- */
#define HMATRIX2TOP_PRAS1_RESETVALUE          _UINT32_(0x30000300)                                 /*  (HMATRIX2TOP_PRAS1) Priority part A for Target 1  Reset Value */

#define HMATRIX2TOP_PRAS1_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS1) Register Mask  */


/* -------- HMATRIX2TOP_PRBS1 : (HMATRIX2TOP Offset: 0x8C) (R/W 32) Priority part B for Target 1 -------- */
#define HMATRIX2TOP_PRBS1_RESETVALUE          _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS1) Priority part B for Target 1  Reset Value */

#define HMATRIX2TOP_PRBS1_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS1) Register Mask  */


/* -------- HMATRIX2TOP_PRAS2 : (HMATRIX2TOP Offset: 0x90) (R/W 32) Priority part A for Target 2 -------- */
#define HMATRIX2TOP_PRAS2_RESETVALUE          _UINT32_(0x3330000)                                  /*  (HMATRIX2TOP_PRAS2) Priority part A for Target 2  Reset Value */

#define HMATRIX2TOP_PRAS2_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS2) Register Mask  */


/* -------- HMATRIX2TOP_PRBS2 : (HMATRIX2TOP Offset: 0x94) (R/W 32) Priority part B for Target 2 -------- */
#define HMATRIX2TOP_PRBS2_RESETVALUE          _UINT32_(0x300)                                      /*  (HMATRIX2TOP_PRBS2) Priority part B for Target 2  Reset Value */

#define HMATRIX2TOP_PRBS2_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS2) Register Mask  */


/* -------- HMATRIX2TOP_PRAS3 : (HMATRIX2TOP Offset: 0x98) (R/W 32) Priority part A for Target 3 -------- */
#define HMATRIX2TOP_PRAS3_RESETVALUE          _UINT32_(0x3000)                                     /*  (HMATRIX2TOP_PRAS3) Priority part A for Target 3  Reset Value */

#define HMATRIX2TOP_PRAS3_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS3) Register Mask  */


/* -------- HMATRIX2TOP_PRBS3 : (HMATRIX2TOP Offset: 0x9C) (R/W 32) Priority part B for Target 3 -------- */
#define HMATRIX2TOP_PRBS3_RESETVALUE          _UINT32_(0x33)                                       /*  (HMATRIX2TOP_PRBS3) Priority part B for Target 3  Reset Value */

#define HMATRIX2TOP_PRBS3_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS3) Register Mask  */


/* -------- HMATRIX2TOP_PRAS4 : (HMATRIX2TOP Offset: 0xA0) (R/W 32) Priority part A for Target 4 -------- */
#define HMATRIX2TOP_PRAS4_RESETVALUE          _UINT32_(0x30)                                       /*  (HMATRIX2TOP_PRAS4) Priority part A for Target 4  Reset Value */

#define HMATRIX2TOP_PRAS4_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS4) Register Mask  */


/* -------- HMATRIX2TOP_PRBS4 : (HMATRIX2TOP Offset: 0xA4) (R/W 32) Priority part B for Target 4 -------- */
#define HMATRIX2TOP_PRBS4_RESETVALUE          _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS4) Priority part B for Target 4  Reset Value */

#define HMATRIX2TOP_PRBS4_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS4) Register Mask  */


/* -------- HMATRIX2TOP_PRAS5 : (HMATRIX2TOP Offset: 0xA8) (R/W 32) Priority part A for Target 5 -------- */
#define HMATRIX2TOP_PRAS5_RESETVALUE          _UINT32_(0x330303)                                   /*  (HMATRIX2TOP_PRAS5) Priority part A for Target 5  Reset Value */

#define HMATRIX2TOP_PRAS5_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS5) Register Mask  */


/* -------- HMATRIX2TOP_PRBS5 : (HMATRIX2TOP Offset: 0xAC) (R/W 32) Priority part B for Target 5 -------- */
#define HMATRIX2TOP_PRBS5_RESETVALUE          _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS5) Priority part B for Target 5  Reset Value */

#define HMATRIX2TOP_PRBS5_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS5) Register Mask  */


/* -------- HMATRIX2TOP_PRAS6 : (HMATRIX2TOP Offset: 0xB0) (R/W 32) Priority part A for Target 6 -------- */
#define HMATRIX2TOP_PRAS6_RESETVALUE          _UINT32_(0x33303)                                    /*  (HMATRIX2TOP_PRAS6) Priority part A for Target 6  Reset Value */

#define HMATRIX2TOP_PRAS6_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS6) Register Mask  */


/* -------- HMATRIX2TOP_PRBS6 : (HMATRIX2TOP Offset: 0xB4) (R/W 32) Priority part B for Target 6 -------- */
#define HMATRIX2TOP_PRBS6_RESETVALUE          _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS6) Priority part B for Target 6  Reset Value */

#define HMATRIX2TOP_PRBS6_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS6) Register Mask  */


/* -------- HMATRIX2TOP_PRAS7 : (HMATRIX2TOP Offset: 0xB8) (R/W 32) Priority part A for Target 7 -------- */
#define HMATRIX2TOP_PRAS7_RESETVALUE          _UINT32_(0x33303)                                    /*  (HMATRIX2TOP_PRAS7) Priority part A for Target 7  Reset Value */

#define HMATRIX2TOP_PRAS7_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS7) Register Mask  */


/* -------- HMATRIX2TOP_PRBS7 : (HMATRIX2TOP Offset: 0xBC) (R/W 32) Priority part B for Target 7 -------- */
#define HMATRIX2TOP_PRBS7_RESETVALUE          _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS7) Priority part B for Target 7  Reset Value */

#define HMATRIX2TOP_PRBS7_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS7) Register Mask  */


/* -------- HMATRIX2TOP_PRAS8 : (HMATRIX2TOP Offset: 0xC0) (R/W 32) Priority part A for Target 8 -------- */
#define HMATRIX2TOP_PRAS8_RESETVALUE          _UINT32_(0x33303)                                    /*  (HMATRIX2TOP_PRAS8) Priority part A for Target 8  Reset Value */

#define HMATRIX2TOP_PRAS8_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS8) Register Mask  */


/* -------- HMATRIX2TOP_PRBS8 : (HMATRIX2TOP Offset: 0xC4) (R/W 32) Priority part B for Target 8 -------- */
#define HMATRIX2TOP_PRBS8_RESETVALUE          _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS8) Priority part B for Target 8  Reset Value */

#define HMATRIX2TOP_PRBS8_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS8) Register Mask  */


/* -------- HMATRIX2TOP_PRAS9 : (HMATRIX2TOP Offset: 0xC8) (R/W 32) Priority part A for Target 9 -------- */
#define HMATRIX2TOP_PRAS9_RESETVALUE          _UINT32_(0x33303)                                    /*  (HMATRIX2TOP_PRAS9) Priority part A for Target 9  Reset Value */

#define HMATRIX2TOP_PRAS9_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS9) Register Mask  */


/* -------- HMATRIX2TOP_PRBS9 : (HMATRIX2TOP Offset: 0xCC) (R/W 32) Priority part B for Target 9 -------- */
#define HMATRIX2TOP_PRBS9_RESETVALUE          _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS9) Priority part B for Target 9  Reset Value */

#define HMATRIX2TOP_PRBS9_Msk                 _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS9) Register Mask  */


/* -------- HMATRIX2TOP_PRAS10 : (HMATRIX2TOP Offset: 0xD0) (R/W 32) Priority part A for Target 10 -------- */
#define HMATRIX2TOP_PRAS10_RESETVALUE         _UINT32_(0x333330)                                   /*  (HMATRIX2TOP_PRAS10) Priority part A for Target 10  Reset Value */

#define HMATRIX2TOP_PRAS10_Msk                _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS10) Register Mask  */


/* -------- HMATRIX2TOP_PRBS10 : (HMATRIX2TOP Offset: 0xD4) (R/W 32) Priority part B for Target 10 -------- */
#define HMATRIX2TOP_PRBS10_RESETVALUE         _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS10) Priority part B for Target 10  Reset Value */

#define HMATRIX2TOP_PRBS10_Msk                _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS10) Register Mask  */


/* -------- HMATRIX2TOP_PRAS11 : (HMATRIX2TOP Offset: 0xD8) (R/W 32) Priority part A for Target 11 -------- */
#define HMATRIX2TOP_PRAS11_RESETVALUE         _UINT32_(0x30)                                       /*  (HMATRIX2TOP_PRAS11) Priority part A for Target 11  Reset Value */

#define HMATRIX2TOP_PRAS11_Msk                _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS11) Register Mask  */


/* -------- HMATRIX2TOP_PRBS11 : (HMATRIX2TOP Offset: 0xDC) (R/W 32) Priority part B for Target 11 -------- */
#define HMATRIX2TOP_PRBS11_RESETVALUE         _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS11) Priority part B for Target 11  Reset Value */

#define HMATRIX2TOP_PRBS11_Msk                _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS11) Register Mask  */


/* -------- HMATRIX2TOP_PRAS12 : (HMATRIX2TOP Offset: 0xE0) (R/W 32) Priority part A for Target 12 -------- */
#define HMATRIX2TOP_PRAS12_RESETVALUE         _UINT32_(0x333303)                                   /*  (HMATRIX2TOP_PRAS12) Priority part A for Target 12  Reset Value */

#define HMATRIX2TOP_PRAS12_Msk                _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS12) Register Mask  */


/* -------- HMATRIX2TOP_PRBS12 : (HMATRIX2TOP Offset: 0xE4) (R/W 32) Priority part B for Target 12 -------- */
#define HMATRIX2TOP_PRBS12_RESETVALUE         _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS12) Priority part B for Target 12  Reset Value */

#define HMATRIX2TOP_PRBS12_Msk                _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS12) Register Mask  */


/* -------- HMATRIX2TOP_PRAS13 : (HMATRIX2TOP Offset: 0xE8) (R/W 32) Priority part A for Target 13 -------- */
#define HMATRIX2TOP_PRAS13_RESETVALUE         _UINT32_(0x33303)                                    /*  (HMATRIX2TOP_PRAS13) Priority part A for Target 13  Reset Value */

#define HMATRIX2TOP_PRAS13_Msk                _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRAS13) Register Mask  */


/* -------- HMATRIX2TOP_PRBS13 : (HMATRIX2TOP Offset: 0xEC) (R/W 32) Priority part B for Target 13 -------- */
#define HMATRIX2TOP_PRBS13_RESETVALUE         _UINT32_(0x00)                                       /*  (HMATRIX2TOP_PRBS13) Priority part B for Target 13  Reset Value */

#define HMATRIX2TOP_PRBS13_Msk                _UINT32_(0x00000000)                                 /* (HMATRIX2TOP_PRBS13) Register Mask  */


/* HMATRIX2TOP register offsets definitions */
#define HMATRIX2TOP_PRAS0_REG_OFST     _UINT32_(0x80)      /* (HMATRIX2TOP_PRAS0) Priority part A for Target 0 Offset */
#define HMATRIX2TOP_PRBS0_REG_OFST     _UINT32_(0x84)      /* (HMATRIX2TOP_PRBS0) Priority part B for Target 0 Offset */
#define HMATRIX2TOP_PRAS1_REG_OFST     _UINT32_(0x88)      /* (HMATRIX2TOP_PRAS1) Priority part A for Target 1 Offset */
#define HMATRIX2TOP_PRBS1_REG_OFST     _UINT32_(0x8C)      /* (HMATRIX2TOP_PRBS1) Priority part B for Target 1 Offset */
#define HMATRIX2TOP_PRAS2_REG_OFST     _UINT32_(0x90)      /* (HMATRIX2TOP_PRAS2) Priority part A for Target 2 Offset */
#define HMATRIX2TOP_PRBS2_REG_OFST     _UINT32_(0x94)      /* (HMATRIX2TOP_PRBS2) Priority part B for Target 2 Offset */
#define HMATRIX2TOP_PRAS3_REG_OFST     _UINT32_(0x98)      /* (HMATRIX2TOP_PRAS3) Priority part A for Target 3 Offset */
#define HMATRIX2TOP_PRBS3_REG_OFST     _UINT32_(0x9C)      /* (HMATRIX2TOP_PRBS3) Priority part B for Target 3 Offset */
#define HMATRIX2TOP_PRAS4_REG_OFST     _UINT32_(0xA0)      /* (HMATRIX2TOP_PRAS4) Priority part A for Target 4 Offset */
#define HMATRIX2TOP_PRBS4_REG_OFST     _UINT32_(0xA4)      /* (HMATRIX2TOP_PRBS4) Priority part B for Target 4 Offset */
#define HMATRIX2TOP_PRAS5_REG_OFST     _UINT32_(0xA8)      /* (HMATRIX2TOP_PRAS5) Priority part A for Target 5 Offset */
#define HMATRIX2TOP_PRBS5_REG_OFST     _UINT32_(0xAC)      /* (HMATRIX2TOP_PRBS5) Priority part B for Target 5 Offset */
#define HMATRIX2TOP_PRAS6_REG_OFST     _UINT32_(0xB0)      /* (HMATRIX2TOP_PRAS6) Priority part A for Target 6 Offset */
#define HMATRIX2TOP_PRBS6_REG_OFST     _UINT32_(0xB4)      /* (HMATRIX2TOP_PRBS6) Priority part B for Target 6 Offset */
#define HMATRIX2TOP_PRAS7_REG_OFST     _UINT32_(0xB8)      /* (HMATRIX2TOP_PRAS7) Priority part A for Target 7 Offset */
#define HMATRIX2TOP_PRBS7_REG_OFST     _UINT32_(0xBC)      /* (HMATRIX2TOP_PRBS7) Priority part B for Target 7 Offset */
#define HMATRIX2TOP_PRAS8_REG_OFST     _UINT32_(0xC0)      /* (HMATRIX2TOP_PRAS8) Priority part A for Target 8 Offset */
#define HMATRIX2TOP_PRBS8_REG_OFST     _UINT32_(0xC4)      /* (HMATRIX2TOP_PRBS8) Priority part B for Target 8 Offset */
#define HMATRIX2TOP_PRAS9_REG_OFST     _UINT32_(0xC8)      /* (HMATRIX2TOP_PRAS9) Priority part A for Target 9 Offset */
#define HMATRIX2TOP_PRBS9_REG_OFST     _UINT32_(0xCC)      /* (HMATRIX2TOP_PRBS9) Priority part B for Target 9 Offset */
#define HMATRIX2TOP_PRAS10_REG_OFST    _UINT32_(0xD0)      /* (HMATRIX2TOP_PRAS10) Priority part A for Target 10 Offset */
#define HMATRIX2TOP_PRBS10_REG_OFST    _UINT32_(0xD4)      /* (HMATRIX2TOP_PRBS10) Priority part B for Target 10 Offset */
#define HMATRIX2TOP_PRAS11_REG_OFST    _UINT32_(0xD8)      /* (HMATRIX2TOP_PRAS11) Priority part A for Target 11 Offset */
#define HMATRIX2TOP_PRBS11_REG_OFST    _UINT32_(0xDC)      /* (HMATRIX2TOP_PRBS11) Priority part B for Target 11 Offset */
#define HMATRIX2TOP_PRAS12_REG_OFST    _UINT32_(0xE0)      /* (HMATRIX2TOP_PRAS12) Priority part A for Target 12 Offset */
#define HMATRIX2TOP_PRBS12_REG_OFST    _UINT32_(0xE4)      /* (HMATRIX2TOP_PRBS12) Priority part B for Target 12 Offset */
#define HMATRIX2TOP_PRAS13_REG_OFST    _UINT32_(0xE8)      /* (HMATRIX2TOP_PRAS13) Priority part A for Target 13 Offset */
#define HMATRIX2TOP_PRBS13_REG_OFST    _UINT32_(0xEC)      /* (HMATRIX2TOP_PRBS13) Priority part B for Target 13 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* HMATRIX2TOP register API structure */
typedef struct
{  /* HSB Matrix */
  __I   uint8_t                        Reserved1[0x80];
  __IO  uint32_t                       HMATRIX2TOP_PRAS0;  /* Offset: 0x80 (R/W  32) Priority part A for Target 0 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS0;  /* Offset: 0x84 (R/W  32) Priority part B for Target 0 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS1;  /* Offset: 0x88 (R/W  32) Priority part A for Target 1 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS1;  /* Offset: 0x8C (R/W  32) Priority part B for Target 1 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS2;  /* Offset: 0x90 (R/W  32) Priority part A for Target 2 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS2;  /* Offset: 0x94 (R/W  32) Priority part B for Target 2 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS3;  /* Offset: 0x98 (R/W  32) Priority part A for Target 3 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS3;  /* Offset: 0x9C (R/W  32) Priority part B for Target 3 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS4;  /* Offset: 0xA0 (R/W  32) Priority part A for Target 4 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS4;  /* Offset: 0xA4 (R/W  32) Priority part B for Target 4 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS5;  /* Offset: 0xA8 (R/W  32) Priority part A for Target 5 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS5;  /* Offset: 0xAC (R/W  32) Priority part B for Target 5 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS6;  /* Offset: 0xB0 (R/W  32) Priority part A for Target 6 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS6;  /* Offset: 0xB4 (R/W  32) Priority part B for Target 6 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS7;  /* Offset: 0xB8 (R/W  32) Priority part A for Target 7 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS7;  /* Offset: 0xBC (R/W  32) Priority part B for Target 7 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS8;  /* Offset: 0xC0 (R/W  32) Priority part A for Target 8 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS8;  /* Offset: 0xC4 (R/W  32) Priority part B for Target 8 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS9;  /* Offset: 0xC8 (R/W  32) Priority part A for Target 9 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS9;  /* Offset: 0xCC (R/W  32) Priority part B for Target 9 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS10; /* Offset: 0xD0 (R/W  32) Priority part A for Target 10 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS10; /* Offset: 0xD4 (R/W  32) Priority part B for Target 10 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS11; /* Offset: 0xD8 (R/W  32) Priority part A for Target 11 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS11; /* Offset: 0xDC (R/W  32) Priority part B for Target 11 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS12; /* Offset: 0xE0 (R/W  32) Priority part A for Target 12 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS12; /* Offset: 0xE4 (R/W  32) Priority part B for Target 12 */
  __IO  uint32_t                       HMATRIX2TOP_PRAS13; /* Offset: 0xE8 (R/W  32) Priority part A for Target 13 */
  __IO  uint32_t                       HMATRIX2TOP_PRBS13; /* Offset: 0xEC (R/W  32) Priority part B for Target 13 */
} hmatrix2top_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32WM_BZ6_HMATRIX2TOP_COMPONENT_H_ */
